package mdm.bff.partlib

object CoatingCondition {
    private val coatingMap = mapOf(
        "02" to "Кадмиевое, хроматированное",
        "08" to "Медное",
        "03" to "Многослойное: медь-никель",
        "04" to "Многослойное: медь-никель-хром",
        "13" to "Никелевое",
        "07" to "Оловянное",
        "12" to "Серебрянное",
        "09" to "Цинковое",
        "01" to "Цинковое, хроматированное",
        "11" to "Окисное из кислых растворов",
        "12" to "Окисное, наполненное хроматами",
        "05" to "Окисное, пропитанное маслом",
        "06" to "Фосфатное, пропитанное маслом"
    )

    fun getCoatingByCode(code: String): String {
        return coatingMap[code] ?: "Без покрытия"
    }
}